export const colors = {
  // Первичный цвет
  primary: {
    100: '#CEE1FF',
    200: '#9EC4FF',
    300: '#609EFF',
    400: '#3080FF',
    500: '#0063FF',
    600: '#0053D5',
    700: '#0047B7',
    800: '#003891',
    900: '#002866',
  },

  // Вторичный цвет
  secondary: {
    100: '#565AFF',
    200: '#4B4FE4',
    300: '#3C40BE',
    400: '#2F3294',
    500: '#21236E',
    600: '#191A55',
    700: '#131340',
    800: '#0D0D2C',
    900: '#08081B',
  },

  // Третичный цвет
  tertiary: {
    100: '#FCEFF2',
    200: '#F9D8DF',
    300: '#F5BEC9',
    400: '#F2AEBC',
    500: '#F2AEBC',
    600: '#DD7A8E',
    700: '#AE4057',
    800: '#7B1C30',
    900: '#550617',
  },

  // Удачный цвет
  success: {
    100: '#66DDB3',
    500: '#00C781',
    300: '#00B374',
  },

  // Предупреждающий цвет
  warning: {
    100: '#FFDC7B',
    500: '#FFC31F',  
    300: '#EAAC00',
  },

  // Цвет ошибки
  error: {
    100: '#FF5377',
    500: '#DA2349',
    300: '#B90127',
  },

  // Серые оттенки
  gray: {
    100: '#FAFAFA',
    200: '#E1E1E1',
    300: '#C8C8C8',
    400: '#AFAFAF',
    500: '#969696',
    600: '#484848',
    700: '#323232',
    800: '#191919',
    900: '#000000',
  },

  // Темные непрозрачности 
  darkOverlay: {
    5: 'rgba(0,0,0,0.05)',
    10: 'rgba(0,0,0,0.10)',
    20: 'rgba(0,0,0,0.20)',
    40: 'rgba(0,0,0,0.40)',
    80: 'rgba(0,0,0,0.80)',
  },

  // Цвет фона
  background: {
    primary: '#EAEBFF',
    secondary: '#8C8EAF',
    tertiary: '#2F315E',
  },

  // Тени 
  shadows: {
  light: '-16px 16px 4px 0px rgba(0, 0, 0, 0.1)',
  medium: '-16px 16px 8px 0px rgba(0, 0, 0, 0.1)',
  strong: '-16px 16px 18px 0px rgba(0, 0, 0, 0.1)',
}
};